# -*- coding: utf-8 -*-
"""Linal_DZ1_Mitrovich

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1sdeyGa_NlvbXeMAwcZojGe1jt3wbdxvr
"""

#1. Найти общее решение и одно частное решение системы линейных уравнений, используя метод Гаусса:
import sympy as sp
from sympy.solvers.solveset import linsolve

x1, x2, x3, x4 = sp.symbols('x1 x2 x3 x4')

eq1= sp.Eq(-3*x1+6*x2+2*x3-5*x4,-6)
eq2= sp.Eq(2*x1-4*x2+2*x4, 4)
eq3= sp.Eq(3*x1 -6*x2-1*x3+ 4*x4, 6)

eqs= [eq1,eq2,eq3] #общее решение
res=linsolve(eqs, (x1,x2,x3,x4))
res

#2. Исследовать систему и найти общее решение в зависимости от значения параметра λ:
import sympy as sp
from sympy.solvers.solveset import linsolve

x1, x2, x3= sp.symbols('x1 x2 x3')
λ= int(input())

eq1= sp.Eq((1+λ)*x1+x2+x3,1)
eq2= sp.Eq(x1+(1+λ)*x2+x3, λ)
eq3= sp.Eq(x1+x2+(1+λ)*x3, λ**2)

eqs= [eq1,eq2,eq3]
res=linsolve(eqs, (x1,x2,x3))
res

#3. Пусть матрица A ∈ M5 6(R) имеет вид []. Для системы Ay = 0, где y ∈ R6, найти количество главных переменных при любом значении x ∈ R.

import numpy as np

x=2
A = np.array([[1, x, 1, 1, x, 1], [x, 1, x, x, 1, x], [x, 1, 1, 1, 1, x],[1, x, 1, 1, x, 1],[1, 1, x, x, 1, 1]])
y = 0/A
y

#(a) Найти все A ∈ Mn(R) такие, что AJ(λ) = J(λ)A.

from sympy import Matrix
from sympy.abc import x

J = Matrix.jordan_block(4, x)
J

from sympy import ones
A = ones(4)
A = A.upper_triangular()
A

print(A*J)

print(J*A)

#про коммутирующие матрицы https://en.wikipedia.org/wiki/Commuting_matrices

#5. Найти матрицу обратную к данной:
import numpy as np

from numpy.linalg import inv
a = np.array([[2., 1., 2., 3.], [0., 1., -1., 0.], [1., 2., 0., 1.],[0., 1., -2., 0]])

ainv = inv(a)
ainv

#6. Вычислить для любого n:
import numpy as np

n = int(input())
a = np.array([[2, 1],
              [5, 3]])
b = np.array([[1, 0],
              [1, 1]])
c = np.array([[3, -1],
              [-5, 2]])
x = np.matmul(a, b, c)
x= x**n
x

#7. Пусть A ∈ Mn(R) такая, что Am = 0 для некоторого m. Показать, что E + A и E − A обратимы, где E ∈ Mn(R) – единичная матрица.


https://math.stackexchange.com/questions/1392476/prove-a-matrix-is-invertible